;ADVENT Dark Events
[DarkEventAbility_AdventAdvancedConditioning X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Conditioning"
LocFlyoverText="Dark Event: Advanced Conditioning"
LocLongDescription="All ADVENT soldiers gain <Ability:ADVENT_ADVANCED_CONDITIONING_HP/>% health and <Ability:ADVENT_ADVANCED_CONDITIONING_MOBILITY/>% mobility."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="ADVENT units have <Ability:ADVENT_ADVANCED_CONDITIONING_HP/>% increased health and <Ability:ADVENT_ADVANCED_CONDITIONING_MOBILITY/>% increased mobility."

[DarkEvent_AdventAdvancedConditioning X2DarkEventTemplate]
+DisplayName="ADVENT Advanced Conditioning"
+SummaryText="All ADVENT soldiers have improved conditioning, increasing their mobility and health."
+QuoteText="\"...I guess Advent can afford to give their troops a proper diet and healthcare plan now. \""
+QuoteTextAuthor="- Central Officer Bradford"
+PreMissionText="All ADVENT soldiers gain additional mobility and  HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Conditioning"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Conditioning"

[DarkEventAbility_AdventAdvancedCombatTraining X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Combat Training"
LocFlyoverText="Dark Event: Advanced Combat Training"
LocLongDescription="All ADVENT soldiers gain <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_AIM/>% increased aim, <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="ADVENT units gain <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_AIM/>% aim, <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVENT_ADVANCED_COMBAT_TRAINING_DEFENSE/> defense."

[DarkEvent_AdventAdvancedCombatTraining X2DarkEventTemplate]
+DisplayName="ADVENT Advanced Combat Training"
+SummaryText="All ADVENT soldiers receive improved combat training, increasing their aim critical chance and defense."
+QuoteText="\"...When did these bucketheads learn to shoot and duck? Let's see if you can dodge a grenade! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All ADVENT soldiers have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Combat Training"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Combat Training"


;Robot Dark Events
[DarkEventAbility_AdvancedMechatronics X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Mechatronics"
LocFlyoverText="Dark Event: Advanced Mechatronics"
LocLongDescription="All ADVENT robotic units gain <Ability:ROBOT_ADVANCED_MECHATRONICS_HP/>% increased health, <Ability:ROBOT_ADVANCED_MECHATRONICS_MOBILITY/>% increased mobility and <Ability:ROBOT_ADVANCED_MECHATRONICS_ARMOR/> armor."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="ADVENT robotic units gain <Ability:ROBOT_ADVANCED_MECHATRONICS_HP/>% increased health, <Ability:ROBOT_ADVANCED_MECHATRONICS_MOBILITY/>% increased mobility and <Ability:ROBOT_ADVANCED_MECHATRONICS_ARMOR/> armor."

[DarkEvent_AdvancedMechatronics X2DarkEventTemplate]
+DisplayName="Advanced Mechatronics"
+SummaryText="All ADVENT robotic units profit from improved mechatronics, increasing their mobility and health."
+QuoteText="\"...Seems like these guys upgraded from Tinmen to Iron Man! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All robotic units have increased mobility and HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Mechatronics"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Mechatronics"

[DarkEventAbility_AdvancedCombatAI X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Combat AI"
LocFlyoverText="Dark Event: Advanced Combat AI"
LocLongDescription="All ADVENT robotic units gain <Ability:ROBOT_ADVANCED_COMBAT_AI_AIM/>% increased aim, <Ability:ROBOT_ADVANCED_COMBAT_AI_CRIT/> critical chance and <Ability:ROBOT_ADVANCED_COMBAT_AI_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="ADVENT robotic units gain <Ability:ROBOT_ADVANCED_COMBAT_AI_AIM/>% aim, <Ability:ROBOT_ADVANCED_COMBAT_AI_CRIT/> critical chance and <Ability:ROBOT_ADVANCED_COMBAT_AI_DEFENSE/> defense."

[DarkEvent_AdvancedCombatAI X2DarkEventTemplate]
+DisplayName="Advanced Combat AI"
+SummaryText="All ADVENT robotic units receive improved combat AI, increasing their aim, critical chance and defense."
+QuoteText="\"...Advent's decided to actually update their robotic units firmware for once. \""
+QuoteTextAuthor="- Chief Engineer Lily Shen"
+PreMissionText="All ADVENT robotic units have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Combat AI"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Combat AI"

;Viper Dark Events
[DarkEventAbility_AdvancedViperGenetics X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Viper Genetics"
LocFlyoverText="Dark Event: Advanced Viper Genetics"
LocLongDescription="All Vipers gain <Ability:ADVANCED_VIPER_GENETICS_HP/>% increased health and <Ability:ADVANCED_VIPER_GENETICS_MOBILITY/>% increased mobility."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="Vipers gain <Ability:ADVANCED_VIPER_GENETICS_HP/>% increased health and <Ability:ADVANCED_VIPER_GENETICS_MOBILITY/>% increased mobility."

[DarkEvent_AdvancedViperGenetics X2DarkEventTemplate]
+DisplayName="Advanced Viper Genetics"
+SummaryText="All Vipers have increased mobility and health."
+QuoteText="\"...Shit. A single bullet isn't enough to bring these bastards down! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Vipers have increased mobility and HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Viper Genetics"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Viper Genetics"

[DarkEventAbility_AdvancedViperCombatTraining X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Viper Combat Training"
LocFlyoverText="Dark Event: Advanced Viper Combat Training"
LocLongDescription="All Vipers gain <Ability:ADVANCED_VIPER_COMBAT_TRAINING_AIM/>% increased aim, <Ability:ADVANCED_VIPER_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_VIPER_COMBAT_TRAINING_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="Vipers gain <Ability:ADVANCED_VIPER_COMBAT_TRAINING_AIM/>% aim, <Ability:ADVANCED_VIPER_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_VIPER_COMBAT_TRAINING_DEFENSE/> defense."

[DarkEvent_AdvancedViperCombatTraining X2DarkEventTemplate]
+DisplayName="Advanced Viper Combat Training"
+SummaryText="All Vipers receive improved combat training, increasing their aim, critical chance and defense."
+QuoteText="\"...When did sneks learn to shoot and dodge? Let's see if you can dodge a grenade! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Vipers have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Viper Combat Training"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Viper Combat Training"

;Sectoid Dark Events
[DarkEventAbility_AdvancedSectoidGenetics X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Sectoid Genetics"
LocFlyoverText="Dark Event: Advanced Sectoid Genetics"
LocLongDescription="All Sectoids gain <Ability:ADVANCED_SECTOID_GENETICS_HP/>% increased health and <Ability:ADVANCED_SECTOID_GENETICS_MOBILITY/>% mobility."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="Sectoids gain <Ability:ADVANCED_SECTOID_GENETICS_HP/>% increased health and <Ability:ADVANCED_SECTOID_GENETICS_MOBILITY/>% mobility."

[DarkEvent_AdvancedSectoidGenetics X2DarkEventTemplate]
+DisplayName="Advanced Sectoid Genetics"
+SummaryText="All Sectoids have increased mobility and health."
+QuoteText="\"...Shit. A single bullet isn't enough to bring these bastards down! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Sectoids have increased mobility and HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Sectoid Genetics"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Sectoid Genetics"

[DarkEventAbility_AdvancedSectoidCombatTraining X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Sectoid Combat Training"
LocFlyoverText="Dark Event: Advanced Sectoid Combat Training"
LocLongDescription="All Sectoids gain <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_AIM/>% increased aim, <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="Sectoids gain <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_AIM/>% aim, <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_SECTOID_COMBAT_TRAINING_DEFENSE/> defense."

[DarkEvent_AdvancedSectoidCombatTraining X2DarkEventTemplate]
+DisplayName="Advanced Sectoid Combat Training"
+SummaryText="All Sectoids receive improved combat training, increasing their aim, critical chance and defense."
+QuoteText="\"...When did these creepy f**kers learn to shoot and dodge? Let's see if you can dodge a grenade! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Sectoids have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Sectoid Combat Training"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Sectoid Combat Training"

;Muton and Berserker Dark Events
[DarkEventAbility_AdvancedMutonGenetics X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Muton Genetics"
LocFlyoverText="Dark Event: Advanced Muton Genetics"
LocLongDescription="All Mutons and Berserkers gain <Ability:ADVANCED_MUTON_GENETICS_HP/>% increased health and <Ability:ADVANCED_MUTON_GENETICS_MOBILITY/>% increased mobility."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="Mutons and Berserkers gain <Ability:ADVANCED_MUTON_GENETICS_HP/>% increased health and <Ability:ADVANCED_MUTON_GENETICS_MOBILITY/>% increased mobility."

[DarkEvent_AdvancedMutonGenetics X2DarkEventTemplate]
+DisplayName="Advanced Muton Genetics"
+SummaryText="All Mutons and Berserkers have increased mobility and health."
+QuoteText="\"...Shit. A single bullet isn't enough to bring these bastards down! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Mutons and Berserkers have increased mobility and HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Muton Genetics"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Muton Genetics"

[DarkEventAbility_AdvancedMutonCombatTraining X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Muton Combat Training"
LocFlyoverText="Dark Event: Advanced Muton Combat Training"
LocLongDescription="All Mutons and Berserkers gain <Ability:ADVANCED_MUTON_COMBAT_TRAINING_AIM/>% increased aim, <Ability:ADVANCED_MUTON_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_MUTON_COMBAT_TRAINING_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="Mutons and Berserkers gain <Ability:ADVANCED_MUTON_COMBAT_TRAINING_AIM/>% aim, <Ability:ADVANCED_MUTON_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_MUTON_COMBAT_TRAINING_DEFENSE/> defense."

[DarkEvent_AdvancedMutonCombatTraining X2DarkEventTemplate]
+DisplayName="Advanced Muton Combat Training"
+SummaryText="All Mutons and Berserkers receive improved combat training, increasing their aim, critical chance and defense."
+QuoteText="\"...When did these hunks of flesh learn to shoot and dodge? Let's see if you can dodge a grenade! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Mutons and Berserkers have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Muton Combat Training"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Muton Combat Training"

;Chryssalid Dark Events
[DarkEventAbility_AdvancedChryssalidGenetics X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Chryssalid Genetics"
LocFlyoverText="Dark Event: Advanced Chryssalid Genetics"
LocLongDescription="All Chryssalids gain <Ability:ADVANCED_CHRYSSALID_GENETICS_HP/>% increased health and <Ability:ADVANCED_CHRYSSALID_GENETICS_MOBILITY/>% increased mobility."
LocHelpText="Bonus mobility and health." 
LocPromotionPopupText="Chryssalids gain <Ability:ADVANCED_CHRYSSALID_GENETICS_HP/>% increased health and <Ability:ADVANCED_CHRYSSALID_GENETICS_MOBILITY/>% increased mobility."

[DarkEvent_AdvancedChryssalidGenetics X2DarkEventTemplate]
+DisplayName="Advanced Chryssalid Genetics"
+SummaryText="All Chryssalids have increased mobility and health."
+QuoteText="\"...Shit. A single bullet isn't enough to bring these bastards down! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Chryssalids have increased mobility and HP."
+PostMissionSuccessText="Dark Event Countered: Advanced Chryssalid Genetics"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Chryssalid Genetics"

[DarkEventAbility_AdvancedChryssalidCombatTraining X2AbilityTemplate]
LocFriendlyName="Dark Event: Advanced Chryssalid Combat Training"
LocFlyoverText="Dark Event: Advanced Chryssalid Combat Training"
LocLongDescription="All Chryssalids gain <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_AIM/>% increased aim, <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_DEFENSE/> defense."
LocHelpText="Bonus aim and defense." 
LocPromotionPopupText="Chryssalids gain <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_AIM/>% aim, <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_CRIT/> critical chance and <Ability:ADVANCED_CHRYSSALID_COMBAT_TRAINING_DEFENSE/> defense."

[DarkEvent_AdvancedChryssalidCombatTraining X2DarkEventTemplate]
+DisplayName="Advanced Chryssalid Combat Training"
+SummaryText="All Chryssalids receive improved combat training, increasing their aim, critical chance and defense."
+QuoteText="\"...When did these creepy things learn to dodge and hit so accurately? Let's see if you can dodge a grenade! \""
+QuoteTextAuthor="- Anonymous XCOM Soldier"
+PreMissionText="All Chryssalids have increased aim, critical chance and defense."
+PostMissionSuccessText="Dark Event Countered: Advanced Chryssalid Combat Training"
+PostMissionFailureText="Failed to Counter Dark Event: Advanced Chryssalid Combat Training"
